package ru.job4j.ocp.ex3;

/*
    Есть класс ремонтника - Repairer.
    Изначально класс мог ремонтировать, метод repair, только грузовики - класс Truck.
    Затем ремонтнику расширили обязанности, обучили и он теперь должен заниматься
    ещё и джипами. Проблема в том, что метод repair принимает в качестве параметра
    класс Truck. Т.е. расширение поведения возможно только через изменение класса.
    Правильнее было бы в параметре метода указаь интерфейс Car, который имплементировали бы
    классы Truck и Jeep.
 */

public class Repairer {
    public void repair(Truck car) {
    }
 }
